FemDesign.Reinforcement.SurfaceReinforcement
surface_rf_type
Surface reinforcement

FemDesign.Reinforcement.SurfaceReinforcement.#ctor
Parameterless constructor for serialization.

FemDesign.Reinforcement.SurfaceReinforcement.#ctor(FemDesign.Geometry.Region,FemDesign.Reinforcement.Straight,FemDesign.Reinforcement.Centric,FemDesign.Reinforcement.Wire)
Private constructor accessed by static methods.

FemDesign.Reinforcement.SurfaceReinforcement.DefineStraightSurfaceReinforcement(FemDesign.Geometry.Region,FemDesign.Reinforcement.Straight,FemDesign.Reinforcement.Wire)
Create straight lay-out surface reinforcement.
Internal static method used by GH components and Dynamo nodes.

FemDesign.Reinforcement.SurfaceReinforcement.AddReinforcementToSlab(FemDesign.Shells.Slab,System.Collections.Generic.List{FemDesign.Reinforcement.SurfaceReinforcement})
Add SurfaceReinforcement to slab.
Internal method use by GH components and Dynamo nodes.